#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/YtseJam/canary-rolling/runs/run-qVrYmQ5cmSqcp4Nf

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02fdd976dc15358bb]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/877efbc40bd670e4]
aws_lb_target_group.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c]
module.web_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03b4abbc2aa4dc2b1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f2ca6eea23a71835]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d68d602a8bc714b5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d4f35d428d06277e]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d92023b7b0a9b60a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-092bffe8da51b2f05]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b59983eab883e59c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f0633d91370d731b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07b2d09c8ee7f7817]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-012509703aef2baf1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b09d3b8a3abe0d17]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-008d548389d3f68d7]
module.lb_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-046d8788965975beb]
module.web_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2238773635]
module.web_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-4015958443]
module.web_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-827565967]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0440aab6a6a78f339]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06331fa3459aa2ed9]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b59983eab883e59c1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-092175a41bdc6623a]
module.lb_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3627565441]
module.lb_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-454230301]
module.lb_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-4117155784]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05087b9bfb63603f3]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029ce3333824c2765]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04dc82de06f5e347b]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lb_sg.module.sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-046d8788965975beb"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress Rule"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
        name                   = "lb-sg-20220301074847170300000001"
        tags                   = {
            "Name" = "lb-sg"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lb_sg.module.sg.aws_security_group_rule.egress_rules[0] has changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-454230301"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }

  # module.lb_sg.module.sg.aws_security_group_rule.ingress_with_self[0] has changed
  ~ resource "aws_security_group_rule" "ingress_with_self" {
      + cidr_blocks              = []
      ~ from_port                = -1 -> 0
        id                       = "sgrule-3627565441"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-046d8788965975beb"
      ~ to_port                  = -1 -> 0
        # (6 unchanged attributes hidden)
    }

  # module.web_sg.module.sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-03b4abbc2aa4dc2b1"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress Rule"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
        name                   = "web-sg-20220301074847172900000002"
        tags                   = {
            "Name" = "web-sg"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.web_sg.module.sg.aws_security_group_rule.egress_rules[0] has changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-827565967"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }

  # module.web_sg.module.sg.aws_security_group_rule.ingress_with_self[0] has changed
  ~ resource "aws_security_group_rule" "ingress_with_self" {
      + cidr_blocks              = []
      ~ from_port                = -1 -> 0
        id                       = "sgrule-4015958443"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-03b4abbc2aa4dc2b1"
      ~ to_port                  = -1 -> 0
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_lb_listener.HTTP will be created
  + resource "aws_lb_listener" "HTTP" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c"
          + type             = "forward"
        }
    }

  # aws_lb_listener.http will be destroyed
  # (because aws_lb_listener.http is not in configuration)
  - resource "aws_lb_listener" "http" {
      - arn               = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/877efbc40bd670e4" -> null
      - id                = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:listener/app/alb-canary-rolling-deployment/6bd1bb56979a4359/877efbc40bd670e4" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/6bd1bb56979a4359" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:targetgroup/tg-canary-rolling-deployment/7d294c9d07d5f16c" -> null
          - type             = "forward" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```
</details>
*Pusher: @adadeeeh, Action: `pull_request`*